package com.yunyou.modules.wms.common.entity;

/**
 * 描述： WMS下拉框值定义
 *
 * @author Jianhua on 2019/1/25
 */
public enum WmsCodeMaster {

	/***************************************************************************
	 * 状态 *
	 * ******************************************************************************
	 */

	/***************************************************************************
	 * PO采购单状态 SYS_WM_PO_STATUS * ***************************************
	 */
	/**
	 * PO创建
	 */
	PO_NEW("00"),
	/**
	 * PO部分收货
	 */
	PO_PART_RECEIVING("10"),
	/**
	 * PO完全收货
	 */
	PO_FULL_RECEIVING("20"),
	/**
	 * PO取消
	 */
	PO_CANCEL("90"),
	/**
	 * PO关闭
	 */
	PO_CLOSE("99"),

	/***************************************************************************
	 * ASN入库单状态 SYS_WM_ASN_STATUS * ***************************************
	 */
	/**
	 * ASN创建
	 */
	ASN_NEW("00"),
	/**
	 * ASN部分收货
	 */
	ASN_PART_RECEIVING("10"),
	/**
	 * ASN完全收货
	 */
	ASN_FULL_RECEIVING("20"),
	/**
	 * ASN取消
	 */
	ASN_CANCEL("90"),
	/**
	 * ASN关闭
	 */
	ASN_CLOSE("99"),
	/***************************************************************************
	 * ASN入库单序列号状态 SYS_WM_ASN_SERIAL_STATUS *
	 * ***************************************
	 */

	/**
	 * 无计划已扫描
	 */
	SERIAL_NOT_PLAN_SCAN("10"),
	/**
	 * 计划未扫描
	 */
	SERIAL_PLAN_NOT_SCAN("30"),
	/**
	 * 计划已扫描
	 */
	SERIAL_PLAN_SCAN("40"),
	/***************************************************************************
	 * QC质检单状态 * ***************************************
	 */
	/**
	 * QC创建
	 */
	QC_NEW("00"),
	/**
	 * QC部分质检
	 */
	QC_PART_QC("10"),
	/**
	 * QC完全质检
	 */
	QC_FULL_QC("20"),
	/**
	 * QC取消
	 */
	QC_CANCEL("90"),
	/**
	 * QC关闭
	 */
	QC_CLOSE("99"),
	/***************************************************************************
	 * 质检属性 SYS_WM_QC_ATT * *************************************** / /** 良品
	 */
	QC_ATT_QUALIFIED("Y"),
	/**
	 * 不良品
	 */
	QC_ATT_NON_QUALIFIED("N"),
	/**
	 * 待检
	 */
	QC_ATT_TO_QC("Q"),
	/***************************************************************************
	 * 质检处理建议 SYS_WM_QC_SUGGEST *
	 **************************************************************************/
	/**
	 * 全部当良品处理
	 */
	QC_SUGGEST_A01("A01"),
	/**
	 * 良品和不良品分开处理，未检部分当良品
	 */
	QC_SUGGEST_A02("A02"),
	/**
	 * 全部当不良品
	 */
	QC_SUGGEST_B01("B01"),
	/**
	 * 良品和不良品分开处理，未检部分当不良品
	 */
	QC_SUGGEST_B02("B02"),
	/**
	 * 升级为全检处理（针对抽检）
	 */
	QC_SUGGEST_C01("C01"),
	/**
	 * 现场决定
	 */
	QC_SUGGEST_D01("D01"),

	/***************************************************************************
	 * 质检阶段 SYS_WM_QC_PHASE * *************************************** / /** 收货前
	 */
	QC_PHASE_B_RCV("RCV"),
	/**
	 * 收货后上架前
	 */
	QC_PHASE_B_PA("PA"),
	/***************************************************************************
	 * SYS_WM_QTY_TYPE 数量类型 *
	 * *****************************************************
	 */
	/**
	 * 数量
	 */
	QTY_TYPE_QTY("QTY"),

	/**
	 * 比例
	 */
	QTY_TYPE_PCT("PCT"),
	/***************************************************************************
	 * SYS_WM_QC_TYPE 质检类型 *
	 * *****************************************************
	 */
	/**
	 * 抽检
	 */
	QC_TYPE_SAMPLE("SAMPLE"),

	/**
	 * 全检
	 */
	QC_TYPE_FULL("FULL"),
	/***************************************************************************
	 * SALE出库单状态 SYS_WM_SALE_STATUS * ***************************************
	 */
	/**
	 * SALE创建
	 */
	SALE_NEW("00"),
	/**
	 * SALE部分预配
	 */
	SALE_PART_PREALLOC("10"),
	/**
	 * SALE完全预配
	 */
	SALE_FULL_PREALLOC("20"),
	/**
	 * SALE部分分配
	 */
	SALE_PART_ALLOC("30"),
	/**
	 * SALE完全分配
	 */
	SALE_FULL_ALLOC("40"),
	/**
	 * SALE部分拣货
	 */
	SALE_PART_PICKING("50"),
	/**
	 * SALE完全拣货
	 */
	SALE_FULL_PICKING("60"),
	/**
	 * SALE部分发货
	 */
	SALE_PART_SHIPPING("70"),
	/**
	 * SALE完全发货
	 */
	SALE_FULL_SHIPPING("80"),
	/**
	 * SALE取消
	 */
	SALE_CANCEL("90"),
	/**
	 * SALE关闭
	 */
	SALE_CLOSE("99"),
	/***************************************************************************
	 * SO出库单状态 SYS_WM_SO_STATUS * ***************************************
	 */
	/**
	 * SO创建
	 */
	SO_NEW("00"),
	/**
	 * SO部分预配
	 */
	SO_PART_PREALLOC("10"),
	/**
	 * SO完全预配
	 */
	SO_FULL_PREALLOC("20"),
	/**
	 * SO部分分配
	 */
	SO_PART_ALLOC("30"),
	/**
	 * SO完全分配
	 */
	SO_FULL_ALLOC("40"),
	/**
	 * SO部分拣货
	 */
	SO_PART_PICKING("50"),
	/**
	 * SO完全拣货
	 */
	SO_FULL_PICKING("60"),
	/**
	 * SO部分发货
	 */
	SO_PART_SHIPPING("70"),
	/**
	 * SO完全发货
	 */
	SO_FULL_SHIPPING("80"),
	/**
	 * SO取消
	 */
	SO_CANCEL("90"),
	/**
	 * SO关闭
	 */
	SO_CLOSE("99"),

	/***************************************************************************
	 * WAVE波次单状态 SYS_WM_WV_STATUS * ***************************************
	 */
	/**
	 * WAVE创建
	 */
	WAVE_NEW("00"),
	/**
	 * WAVE部分预配
	 */
	WAVE_PART_PREALLOC("10"),
	/**
	 * WAVE完全预配
	 */
	WAVE_FULL_PREALLOC("20"),
	/**
	 * WAVE部分分配
	 */
	WAVE_PART_ALLOC("30"),
	/**
	 * WAVE完全分配
	 */
	WAVE_FULL_ALLOC("40"),
	/**
	 * WAVE部分拣货
	 */
	WAVE_PART_PICKING("50"),
	/**
	 * WAVE完全拣货
	 */
	WAVE_FULL_PICKING("60"),
	/**
	 * WAVE部分发货
	 */
	WAVE_PART_SHIPPING("70"),
	/**
	 * WAVE完全发货
	 */
	WAVE_FULL_SHIPPING("80"),
	/**
	 * WAVE取消
	 */
	WAVE_CANCEL("90"),

	/***************************************************************************
	 * ALLOC分配记录状态 SYS_WM_ALLOC_STATUS * ***************************************
	 */
	/**
	 * ALLOC完全分配
	 */
	ALLOC_FULL_ALLOC("40"),
	/**
	 * ALLOC完全拣货
	 */
	ALLOC_FULL_PICKING("60"),
	/**
	 * ALLOC完全发货
	 */
	ALLOC_FULL_SHIPPING("80"),

	/***************************************************************************
	 * ALLOC分配记录打包状态 SYS_WM_PACK_STATUS * ***************************************
	 */
	/**
	 * PACK未打包
	 */
	PACK_NEW("00"),
	/**
	 * 部分打包
	 */
	PACK_PART("10"),
	/**
	 * 完全打包
	 */
	PACK_FULL("20"),

	/***************************************************************************
	 * AD调整单状态 SYS_WM_AD_STATUS * ***************************************
	 */
	/**
	 * AD创建
	 */
	AD_NEW("00"),
	/**
	 * AD部分调整
	 */
	AD_PART_ADJUSTMENT("10"),
	/**
	 * AD完全调整
	 */
	AD_FULL_ADJUSTMENT("20"),
	/**
	 * AD取消
	 */
	AD_CANCEL("90"),
	/**
	 * AD关闭
	 */
	AD_CLOSE("99"),

	/**
	 * AD增加
	 */
	AD_A("A"),
	/**
	 * AD减少
	 */
	AD_R("R"),

	/***************************************************************************
	 * TF转移单状态 SYS_WM_TF_STATUS * ***************************************
	 */
	/**
	 * TF创建
	 */
	TF_NEW("00"),
	/**
	 * TF部分转移
	 */
	TF_PART_TRANSFER("10"),
	/**
	 * TF完全转移
	 */
	TF_FULL_TRANSFER("20"),
	/**
	 * TF取消
	 */
	TF_CANCEL("90"),
	/**
	 * TF关闭
	 */
	TF_CLOSE("99"),

	/***************************************************************************
	 * CC盘点单状态 SYS_WM_COUNT_STATUS * ***************************************
	 */
	/**
	 * CC创建
	 */
	CC_NEW("00"),
	/**
	 * CC生成任务
	 */
	CC_CREATE_TSK("10"),
	/**
	 * CC部分盘点
	 */
	CC_PART_COUNT("70"),
	/**
	 * CC完全盘点
	 */
	CC_FULL_COUNT("80"),
	/**
	 * CC取消
	 */
	CC_CANCEL("90"),
	/**
	 * CC关闭
	 */
	CC_CLOSE("99"),

	/***************************************************************************
	 * IVHL冻结库存单状态 SYS_WM_HOLD_STATUS * ***************************************
	 */
	/**
	 * IVHL冻结
	 */
	IVHL_HOLD("99"),
	/**
	 * IVHL释放
	 */
	IVHL_CANCEL_HOLD("90"),

	/***************************************************************************
	 * TSK任务状态 SYS_WM_TASK_STATUS * ***************************************
	 */
	/**
	 * TSK创建
	 */
	TSK_NEW("00"),
	/**
	 * TSK完成
	 */
	TSK_COMPLETE("99"),

	/***************************************************************************
	 * AUDIT审核状态 SYS_AUDIT_STATUS * ***************************************
	 */
	/**
	 * AUDIT未审核
	 */
	AUDIT_NEW("00"),
	/**
	 * AUDIT已审核
	 */
	AUDIT_CLOSE("99"),
	/**
	 * AUDIT不审核
	 */
	AUDIT_NOT("90"),

	/***************************************************************************
	 * ODHL订单冻结状态 SYS_WM_ORDER_HOLD_STATUS *
	 * *******************************************
	 */
	/**
	 * ODHL无冻结
	 */
	ODHL_NO_HOLD("00"),
	/**
	 * ODHL冻结
	 */
	ODHL_HOLD("99"),

	/***************************************************************************
	 * ITC拦截状态 SYS_WM_INTERCEPT_STATUS *
	 * *******************************************
	 */
	/**
	 * ITC无拦截
	 */
	ITC_NO_INTERCEPT("00"),
	/**
	 * ITC拦截
	 */
	ITC_INTERCEPT("10"),
	/**
	 * ITC待归储
	 */
	ITC_WAITING("20"),
	/**
	 * ITC拦截失败
	 */
	ITC_FAIL("90"),
	/**
	 * ITC拦截成功
	 */
	ITC_SUCCESS("99"),

	/***************************************************************************
	 * CHECK分配明细复核状态 SYS_WM_CHECK_STATUS *
	 * ***************************************
	 */
	/**
	 * CHECK未复核
	 */
	CHECK_NEW("00"),
	/**
	 * CHECK已复核
	 */
	CHECK_CLOSE("99"),
	/**
	 * CHECK不复核
	 */
	CHECK_NOT("90"),

	/***************************************************************************
	 * LD装车单状态 SYS_WM_LD_STATUS * ***************************************
	 */
	/**
	 * LD创建
	 */
	LD_NEW("10"),
	/**
	 * LD部分装车
	 */
	LD_PART_LOAD("30"),
	/**
	 * LD完全装车
	 */
	LD_FULL_LOAD("40"),
	/**
	 * LD部分交接
	 */
	LD_PART_DELIVERY("50"),
	/**
	 * LD完全交接
	 */
	LD_FULL_DELIVERY("60"),
	/**
	 * LD关闭
	 */
	LD_CLOSE("99"),

	/***************************************************************************
	 * 加工单状态 SYS_WM_KIT_STATUS * ***************************************
	 */
	/**
	 * KIT创建
	 */
	KIT_NEW("00"),
	/**
	 * KIT部分加工
	 */
	KIT_PART_KIT("70"),
	/**
	 * KIT完全加工
	 */
	KIT_FULL_KIT("80"),
	/**
	 * KIT取消订单
	 */
	KIT_CANCEL("90"),
	/**
	 * KIT关闭订单
	 */
	KIT_CLOSE("99"),
	/***************************************************************************
	 * 加工单子件状态 SYS_WM_SUB_KIT_STATUS * ***************************************
	 */
	/**
	 * 创建
	 */
	SUB_KIT_NEW("00"),
	/**
	 * 部分分配
	 */
	SUB_KIT_PART_ALLOC("30"),
	/**
	 * 完全分配
	 */
	SUB_KIT_FULL_ALLOC("40"),
	/**
	 * 部分拣货
	 */
	SUB_KIT_PART_PICKING("50"),
	/**
	 * 完全拣货
	 */
	SUB_KIT_FULL_PICKING("60"),
	/**
	 * 部分加工
	 */
	SUB_KIT_PART_KIT("70"),
	/**
	 * 完全加工
	 */
	SUB_KIT_FULL_KIT("80"),

	/***************************************************************************
	 * 类型 *
	 * ******************************************************************************
	 */

	/***************************************************************************
	 * PO采购单类型 SYS_WM_PO_TYPE * ***************************************
	 */
	/**
	 * 普通入库
	 */
	PO_PI("PI"),
	/**
	 * 调拨入库
	 */
	PO_AI("AI"),
	/**
	 * 退货入库
	 */
	PO_RI("RI"),
	/**
	 * 换货入库
	 */
	PO_EI("EI"),

	/***************************************************************************
	 * ASN入库单类型 SYS_WM_ASN_TYPE * ***************************************
	 */
	/**
	 * 普通入库
	 */
	ASN_PI("PI"),
	/**
	 * 调拨入库
	 */
	ASN_AI("AI"),
	/**
	 * 退货入库
	 */
	ASN_RI("RI"),
	/**
	 * 换货入库
	 */
	ASN_EI("EI"),
	/**
	 * 调整入库
	 */
	ASN_ADI("ADI"),
	/**
	 * 盘点入库
	 */
	ASN_CI("CI"),
    /**
     * 越库入库
     */
    ASN_XI("XI"),

	/***************************************************************************
	 * SO出库单类型 SYS_WM_SO_TYPE * ***************************************
	 */
	/**
	 * 普通出库
	 */
	SO_PO("PO"),
	/**
	 * 调拨出库
	 */
	SO_AO("AO"),
	/**
	 * 退厂出库
	 */
	SO_RO("RO"),
	/**
	 * 换货出库
	 */
	SO_EO("EO"),
	/**
	 * 领用出库
	 */
	SO_LO("LO"),
	/**
	 * 调整出库
	 */
	SO_ADO("ADO"),
	/**
	 * 盘点出库
	 */
	SO_CO("CO"),
    /**
     * 越库出库
     */
    SO_XO("XO"),
	/***************************************************************************
	 * 销售类型 SYS_WM_SALE_TYPE * ***************************************
	 */
	/**
	 * 普通出库
	 */
	SALE_PO("PO"),
	/**
	 * 调拨出库
	 */
	SALE_AO("AO"),
	/**
	 * 退厂出库
	 */
	SALE_RO("RO"),
	/**
	 * 换货出库
	 */
	SALE_EO("EO"),
	/***************************************************************************
	 * CC盘点单类型 SYS_WM_COUNT_TYPE * ***************************************
	 */
	/**
	 * 普通盘点
	 */
	CC_NC("NC"),
	/**
	 * 差异盘点
	 */
	CC_GC("GC"),

	/***************************************************************************
	 * ORDER 单据类型 SYS_WM_ORDER_TYPE * ***************************************
	 */
	/**
	 * 入库单
	 */
	ORDER_ASN("ASN"),
	/**
	 * 出货单
	 */
	ORDER_SO("SO"),
	/**
	 * 转移单
	 */
	ORDER_TF("TF"),
	/**
	 * 调整单
	 */
	ORDER_AD("AD"),
	/**
	 * 质检单
	 */
	ORDER_QC("QC"),
	/**
	 * 加工单
	 */
	ORDER_KIT("KIT"),
	/**
	 * 装车单
	 */
	ORDER_LD("LD"),

	/***************************************************************************
	 * TRAN库存交易类型 SYS_WM_TRAN_TYPE * ***************************************
	 */
	/**
	 * 收货
	 */
	TRAN_RCV("RCV"),
	/**
	 * 取消收货
	 */
	TRAN_CRCV("CRCV"),
	/**
	 * 上架
	 */
	TRAN_PA("PA"),
	/**
	 * 拣货
	 */
	TRAN_PK("PK"),
	/**
	 * 取消拣货
	 */
	TRAN_CPK("CPK"),
	/**
	 * 调整
	 */
	TRAN_AD("AD"),
	/**
	 * 移动
	 */
	TRAN_MV("MV"),
	/**
	 * 转移
	 */
	TRAN_TF("TF"),
	/**
	 * 补货
	 */
	TRAN_RP("RP"),
	/**
	 * 发货
	 */
	TRAN_SP("SP"),
	/**
	 * 取消发货
	 */
	TRAN_CSP("CSP"),
	/**
	 * 打包
	 */
	TRAN_PACK("PACK"),
	/**
	 * 装载移动
	 */
	TRAN_LD("LD"),
	/**
	 * 质检
	 */
	TRAN_QTF("QTF"),
	/**
	 * 加工父件入库
	 */
	TRAN_KIN("KIN"),
	/**
	 * 取消加工父件入库
	 */
	TRAN_CKIN("CKIN"),
	/**
	 * 加工子件出库
	 */
	TRAN_KOUT("KOUT"),
	/**
	 * 取消加工子件出库
	 */
	TRAN_CKOUT("CKOUT"),
	/**
	 * 加工转移
	 */
	TRAN_KTF("KTF"),
	/**
	 * 取消加工转移
	 */
	TRAN_CKTF("CKTF"),

	/***************************************************************************
	 * HOLD_BY 冻结方式 SYS_WM_HOLD_TYPE *
	 * *******************************************
	 */
	/**
	 * 按货主
	 */
	HOLD_BY_OWNER("1"),
	/**
	 * 按货主和商品
	 */
	HOLD_BY_SKU("2"),
	/**
	 * 按批次
	 */
	HOLD_BY_LOT("3"),
	/**
	 * 按库位
	 */
	HOLD_BY_LOC("4"),
	/**
	 * 按跟踪号
	 */
	HOLD_BY_ID("5"),

	/***************************************************************************
	 * LOC_USE 使用类型 SYS_WM_LOC_USE_TYPE *
	 * ***************************************
	 */
	/**
	 * 存储库位
	 */
	LOC_USE_RS("RS"),
	/**
	 * 箱拣货库位
	 */
	LOC_USE_CS("CS"),
	/**
	 * 件拣货库位
	 */
	LOC_USE_EA("EA"),
	/**
	 * 箱件合并拣货库位
	 */
	LOC_USE_PC("PC"),
	/**
	 * 过渡库位
	 */
	LOC_USE_ST("ST"),
	/**
	 * 理货站
	 */
	LOC_USE_SS("SS"),
	/**
	 * 品质库位
	 */
	LOC_USE_QC("QC"),
	/**
	 * 加工台
	 */
	LOC_USE_KT("KT"),
	/**
	 * 越库库位
	 */
	LOC_USE_CD("CD"),

	/***************************************************************************
	 * LOC_TYPE 商品拣货位类型 SYS_WM_SKU_LOC_TYPE *
	 * ***********************************************
	 */
	/**
	 * 箱拣货库位
	 */
	LOC_TYPE_CS("CS"),
	/**
	 * 件拣货库位
	 */
	LOC_TYPE_EA("EA"),
	/**
	 * 箱件合并拣货库位
	 */
	LOC_TYPE_PC("PC"),

	/***************************************************************************
	 * LD_TYPE 装车单类型 SYS_WM_LD_TYPE *
	 * ***********************************************
	 */
	/**
	 * 无限制
	 */
	LD_BY_FREE("FREE"),
	/**
	 * 按承运商
	 */
	LD_BY_CARRIER("CARRIER"),
	/**
	 * 按路线
	 */
	LD_BY_LINE("LINE"),
	/**
	 * 按收货人
	 */
	LD_BY_CONSIGNEE("CONSIGNEE"),

	/***************************************************************************
	 * SUB_SKU_TYPE 子件类型 SYS_WM_SUB_SKU_TYPE *
	 * *****************************************************
	 */
	/**
	 * 普通
	 */
	SUB_SKU_TYPE_COMMON("COMMON"),

	/**
	 * 辅料
	 */
	SUB_SKU_TYPE_ACC("ACC"),

	/***************************************************************************
	 * 加工类型 SYS_WM_KIT_TYPE * ***************************************
	 */
	/**
	 * 组合加工（Ａ=Ｂ+Ｃ）
	 */
	KIT_TYPE_COMBINE("COM"),
	/**
	 * 辅料加工（Ａ=Ａ+辅料）
	 */
	KIT_TYPE_ACCESSORY("ACC"),
	/**
	 * 增值加工（A=A）
	 */
	KIT_TYPE_VA("VA"),

	/***************************************************************************
	 * 原因 *
	 * ******************************************************************************
	 */
	/***************************************************************************
	 * AD调整原因 SYS_WM_AD_REASON * ***************************************
	 */
	/**
	 * 损耗
	 */
	AD_DM("DM"),
	/**
	 * 盘点
	 */
	AD_CN("CN"),
	/**
	 * 其他
	 */
	AD_OT("OT"),

	/***************************************************************************
	 * TF转移原因 SYS_WM_TF_REASON * ***************************************
	 */
	/**
	 * 转移货权
	 */
	TF_OWNER("OWNER"),
	/**
	 * 转移商品
	 */
	TF_SKU("SKU"),
	/**
	 * 转移批次
	 */
	TF_LOT("LOT"),

	/***************************************************************************
	 * HOLD冻结原因 SYS_WM_HOLD_REASON * ***************************************
	 */
	/**
	 * 商品损坏
	 */
	HOLD_REASON_DM("DM"),
	/**
	 * 过期商品
	 */
	HOLD_REASON_EP("EP"),
	/**
	 * 库位冻结状态
	 */
	HOLD_REASON_LH("LH"),
	/**
	 * 其他
	 */
	HOLD_REASON_OT("OT"),

	/***************************************************************************
	 * HOLD冻结状态 SYS_WM_HOLD_STATUS * ***************************************
	 */
	/**
	 * 冻结
	 */
	HOLD_STATUS_HOLD("99"),
	/**
	 * 释放
	 */
	HOLD_STATUS_RELEASE("90"),

	/***************************************************************************
	 * 基础数据 *
	 * ******************************************************************************
	 */

	/***************************************************************************
	 * PRIORITY 单据优先级 SYS_WM_PRIORITY * ***************************************
	 */
	/**
	 * 1最高
	 */
	PRIORITY_1("1"),
	/**
	 * 2普通+
	 */
	PRIORITY_2("2"),
	/**
	 * 3普通
	 */
	PRIORITY_3("3"),
	/**
	 * 4普通-
	 */
	PRIORITY_4("4"),
	/**
	 * 5最低
	 */
	PRIORITY_5("5"),

	/***************************************************************************
	 * LOC ABC 库位ABC SYS_WM_ABC * ***************************************
	 */
	/**
	 * A
	 */
	LOC_ABC_A("A"),
	/**
	 * B
	 */
	LOC_ABC_B("B"),
	/**
	 * C
	 */
	LOC_ABC_C("C"),

	/***************************************************************************
	 * ORDER BY排序 SYS_WM_ORDER_BY * ***************************************
	 */
	/**
	 * 升序
	 */
	ORDER_BY_ASC("A"),
	/**
	 * 降序
	 */
	ORDER_BY_DESC("D"),
	/**
	 * 精确匹配
	 */
	ORDER_BY_EQUAL("E"),

	/***************************************************************************
	 * ZONE_TYPE 库区类型 SYS_WM_ZONE_TYPE * ***************************************
	 */
	/**
	 * 平面仓库区
	 */
	ZONE_TYPE_1("1"),
	/**
	 * 货架仓库区
	 */
	ZONE_TYPE_2("2"),
	/**
	 * 高架仓库区
	 */
	ZONE_TYPE_3("3"),
	/**
	 * 重力式货架库区
	 */
	ZONE_TYPE_4("4"),
	/**
	 * 堆垛机货架库区
	 */
	ZONE_TYPE_5("5"),

	/***************************************************************************
	 * LOC_CATEGORY 库位种类 SYS_WM_CATEGORY *
	 * ***************************************
	 */
	/**
	 * 平面仓库位
	 */
	LOC_CATEGORY_1("1"),
	/**
	 * 货架仓库位
	 */
	LOC_CATEGORY_2("2"),
	/**
	 * 高架仓库位
	 */
	LOC_CATEGORY_3("3"),
	/**
	 * 重力式货架库位
	 */
	LOC_CATEGORY_4("4"),
	/**
	 * 堆垛机货架库位
	 */
	LOC_CATEGORY_5("5"),

	/***************************************************************************
	 * LOC_STATUS 库位状态 SYS_WM_LOC_STATUS *
	 * ***************************************
	 */
	/**
	 * 正常
	 */
	LOC_STATUS_OK("00"),
	/**
	 * 冻结
	 */
	LOC_STATUS_HOLD("99"),

	/***************************************************************************
	 * RESERVE上架库位指定规则SYS_WM_RESERVE_CODE *
	 * ******************************************
	 */
	/**
	 * 人工指定库位
	 */
	RESERVE_MAN("MAN"),
	/**
	 * 收货时计算库位
	 */
	RESERVE_RCV("RCV"),
	/**
	 * 上架时计算库位
	 */
	RESERVE_PA("PA"),
	/**
	 * 收货前计算库位-一步收货
	 */
	RESERVE_B_RCV_ONE("B_RCV_ONE"),
	/**
	 * 收货前计算库位-两步收货
	 */
	RESERVE_B_RCV_TWO("B_RCV_TWO"),

	/***************************************************************************
	 * DG CLASS 危险品等级 SYS_WM_DG_CLASS *
	 * ******************************************
	 */
	/**
	 * 爆炸物
	 */
	DG_CLASS_1("1"),
	/**
	 * 压缩的、液化的或受压溶解的气体
	 */
	DG_CLASS_2("2"),
	/**
	 * 易燃液体
	 */
	DG_CLASS_3("3"),
	/**
	 * 易燃固体、起火物质、与水反应物质
	 */
	DG_CLASS_4("4"),
	/**
	 * 氧化物质及有机过氧化物
	 */
	DG_CLASS_5("5"),
	/**
	 * 毒性物质及感染性物质
	 */
	DG_CLASS_6("6"),
	/**
	 * 放射性物质
	 */
	DG_CLASS_7("7"),
	/**
	 * 腐蚀性物质
	 */
	DG_CLASS_8("8"),
	/**
	 * 其他危险物质或物品
	 */
	DG_CLASS_9("9"),

	/***************************************************************************
	 * INPUT 输入控制 SYS_WM_INPUT_CONTROL *
	 * ******************************************
	 */
	/**
	 * 必输
	 */
	INPUT_REQUIRED("R"),
	/**
	 * 可选
	 */
	INPUT_OPTIONAL("O"),
	/**
	 * 禁用
	 */
	INPUT_FORBIDDEN("F"),

	/***************************************************************************
	 * FIELD TYPE 字段展示类型 SYS_WM_FIELD_TYPE *
	 * ******************************************
	 */
	/**
	 * 下拉框
	 */
	FIELD_COMBOBOX("ComboBox"),
	/**
	 * 日期
	 */
	FIELD_DATE("DateField"),
	/**
	 * 日期时间
	 */
	FIELD_DATETIME("DateTimeField"),
	/**
	 * 数字
	 */
	FIELD_NUMBER("NumberField"),
	/**
	 * 弹出框
	 */
	FIELD_POPWIN("PopField"),
	/**
	 * 字符串
	 */
	FIELD_STRING("TextInput"),

	/***************************************************************************
	 * FIELD TYPE 周转规则优先类型 SYS_WM_ROTATION_TYPE *
	 * *************************************************
	 */
	/**
	 * 库存周转规则优先
	 */
	ROTATION("ROTATION"),
	/**
	 * 包装规则优先
	 */
	PACKAGE("PACKAGE"),

	/***************************************************************************
	 * LOC RESTRICT 库位限制 SYS_WM_LOC_RESTRICT *
	 * *************************************************
	 */
	/**
	 * 没有限制
	 */
	LOC_RESTRICT_1("1"),
	/**
	 * 库位必须为空，即使库位空间足够，也必须查找空的库位
	 */
	LOC_RESTRICT_2("2"),
	/**
	 * 不许混放商品，即使库位属性为允许
	 */
	LOC_RESTRICT_3("3"),
	/**
	 * 不许混放批次,即使库位属性为允许
	 */
	LOC_RESTRICT_4("4"),
	/**
	 * 可以混放批次，但只限入库日期不同
	 */
	LOC_RESTRICT_5("5"),
	/**
	 * 库位内必须有相同商品的库存
	 */
	LOC_RESTRICT_6("6"),
	/**
	 * 库位内必须有相同批号的库存
	 */
	LOC_RESTRICT_7("7"),

	/***************************************************************************
	 * SPACE RESTRICT 空间限制 SYS_WM_SPACE_RESTRICT *
	 * *************************************************
	 */
	/**
	 * 没有限制
	 */
	SPACE_RESTRICT_NONE("NONE"),
	/**
	 * 体积限定
	 */
	SPACE_RESTRICT_CUBIC("CUBIC"),
	/**
	 * 重量限定
	 */
	SPACE_RESTRICT_WEIGHT("WEIGHT"),
	/**
	 * 数量限定
	 */
	SPACE_RESTRICT_EA("EA"),
	/**
	 * 箱数限定
	 */
	SPACE_RESTRICT_CASE("CASE"),
	/**
	 * 托盘数限定
	 */
	SPACE_RESTRICT_PALLET("PALLET"),

	/***************************************************************************
	 * OPERATOR 运算符 SYS_WM_OPERATOR * ************************************
	 */
	/**
	 * =
	 */
	OPERATOR_1("="),
	/**
	 * !=
	 */
	OPERATOR_2("!="),
	/**
	 * <
	 */
	OPERATOR_3("<"),
	/**
	 * <=
	 */
	OPERATOR_4("<="),
	/**
	 * >
	 */
	OPERATOR_5(">"),
	/**
	 * >=
	 */
	OPERATOR_6(">="),
	/**
	 * LIKE
	 */
	OPERATOR_LIKE("LIKE"),
	/**
	 * NOT LIKE
	 */
	OPERATOR_NOT_LIKE("NOT LIKE"),
	/***************************************************************************
	 * AND和OR 运算符 SYS_WM_AND_OR * ************************************
	 */
	/**
	 * AND
	 */
	AND("AND"),
	/**
	 * OR
	 */
	OR("OR"),
	/***************************************************************************
	 * COUNT RANGE 盘点范围 SYS_WM_COUNT_RANGE *
	 * *******************************************
	 */
	/**
	 * 全盘
	 */
	COUNT_RANGE_1("1"),
	/**
	 * 抽盘
	 */
	COUNT_RANGE_2("2"),
	/**
	 * 动碰盘点
	 */
	COUNT_RANGE_3("3"),
	/**
	 * 循环盘点
	 */
	COUNT_RANGE_4("4"),

	/***************************************************************************
	 * COUNT MODE 盘点方式 SYS_WM_COUNT_MODE *
	 * ****************************************
	 */
	/**
	 * 盲盘
	 */
	COUNT_MODE_B("B"),
	/**
	 * 明盘
	 */
	COUNT_MODE_O("O"),

	/***************************************************************************
	 * COUNT METHOD 盘点方法 SYS_WM_COUNT_METHOD *
	 * ********************************************
	 */
	/**
	 * 静态盘点
	 */
	COUNT_METHOD_S("S"),
	/**
	 * 动态盘点
	 */
	COUNT_METHOD_D("D"),

	/***************************************************************************
	 * LIFE TYPE 周期类型 SYS_WM_LIFE_TYPE * **************************************
	 */
	/**
	 * 生产日期
	 */
	LIFE_TYPE_P("P"),
	/**
	 * 失效日期
	 */
	LIFE_TYPE_E("E"),

	/***************************************************************************
	 * PA_RULE 上架主规则 SYS_WM_PA_RULE * ***************************************
	 */
	/**
	 * 上架到上架规则指定的目标库位
	 */
	PA_RULE_A01("A01"),
	/**
	 * 上架到商品指定的上架库位
	 */
	PA_RULE_A02("A02"),
	/**
	 * 上架到商品指定的件拣货位
	 */
	PA_RULE_A03("A03"),
	/**
	 * 上架到商品指定的箱拣货位
	 */
	PA_RULE_A04("A04"),
	/**
	 * 上架到商品指定的箱件合并拣货位
	 */
	PA_RULE_A05("A05"),
	/**
	 * 如果收货库位等于上架规则的源库位，就上架到规则指定的目标库位
	 */
	PA_RULE_A06("A06"),
	/**
	 * 如果上架规则指定的目标库位符合限制，就上架到该库位
	 */
	PA_RULE_A07("A07"),
	/**
	 * 在上架规则指定的目标库区内查找空库位
	 */
	PA_RULE_B01("B01"),
	/**
	 * 在商品指定的上架库区内查找空库位
	 */
	PA_RULE_B02("B02"),
	/**
	 * 查找离商品件拣货位最近的空库位
	 */
	PA_RULE_B03("B03"),
	/**
	 * 查找离商品箱拣货位最近的空库位
	 */
	PA_RULE_B04("B04"),
	/**
	 * 查找离商品箱件合并拣货位最近的空库位
	 */
	PA_RULE_B05("B05"),
	/**
	 * 在上架规则指定的目标库区内查找非空库位
	 */
	PA_RULE_C01("C01"),
	/**
	 * 在商品指定的上架库区内查找非空库位
	 */
	PA_RULE_C02("C02"),
	/**
	 * 查找离商品件拣货位最近的非空库位
	 */
	PA_RULE_C03("C03"),
	/**
	 * 查找离商品箱拣货位最近的非空库位
	 */
	PA_RULE_C04("C04"),
	/**
	 * 查找离商品箱件合并拣货位最近的非空库位
	 */
	PA_RULE_C05("C05"),
	/**
	 * 在上架规则指定的目标库区内查找存在相同商品的库位
	 */
	PA_RULE_D01("D01"),
	/**
	 * 在商品指定的上架库区内查找存在相同商品的库位
	 */
	PA_RULE_D02("D02"),
	/**
	 * 查找离商品件拣货位最近的存在相同商品的库位
	 */
	PA_RULE_D03("D03"),
	/**
	 * 查找离商品箱拣货位最近的存在相同商品的库位
	 */
	PA_RULE_D04("D04"),
	/**
	 * 查找离商品箱件合并拣货位最近的存在相同商品的库位
	 */
	PA_RULE_D05("D05"),
	/**
	 * 查找离商品箱件合并拣货位最近的存在相同商品的库位
	 */
	PA_RULE_E01("E01"),

	/***************************************************************************
	 * WAVE_RULE 波次主规则 SYS_WM_WAVE_RULE *
	 * ***************************************
	 */
	/**
	 * 按订单数
	 */
	WAVE_RULE_1("1"),
	/**
	 * 按订单重合率
	 */
	WAVE_RULE_2("2"),
	/**
	 * 按承运人
	 */
	WAVE_RULE_3("3"),
	/**
	 * 按收货人
	 */
	WAVE_RULE_4("4"),
	/**
	 * 按路线
	 */
	WAVE_RULE_5("5"),
	/**
	 * 按订单重合率分组
	 */
	WAVE_RULE_6("6"),
	/**
	 * 按订单明细完全重合分组
	 */
	WAVE_RULE_7("7"),

	/***************************************************************************
	 * WAVE_CONDITION 波次限制条件 SYS_WM_WAVE_CONDITION *
	 * **************************************************
	 */
	/**
	 * 订单数
	 */
	WAVE_CONDITION_ORDERQTY("1"),
	/**
	 * 订单重合率
	 */
	WAVE_CONDITION_ORDERDOUBLE("2"),
	/**
	 * 毛重
	 */
	WAVE_CONDITION_WEIGHT("3"),
	/**
	 * 体积
	 */
	WAVE_CONDITION_CUBIC("4"),
	/**
	 * 订单重合率分组
	 */
	WAVE_CONDITION_ORDERDOUBLE_GROUP("3"),

	/***************************************************************************
	 * ORDER_ATT_CODE 出库单属性 SYS_WM_ORDER_ATT *
	 * ************************************************
	 */
	/**
	 * 出库单类型
	 */
	ORDER_ATT_SO_TYPE("SO_TYPE"),

	/**
	 * 优先级别
	 */
	ORDER_ATT_PRIORITY("PRIORITY"),
	/**
	 * 货主编码
	 */
	ORDER_ATT_OWNER_CODE("OWNER_CODE"),
	/**
	 * 承运人编码
	 */
	ORDER_ATT_CARRIER_CODE("CARRIER_CODE"),
	/**
	 * 路线
	 */
	ORDER_ATT_LINE("LINE"),
	/**
	 * 收货人编码
	 */
	ORDER_ATT_CONSIGNEE_CODE("CONSIGNEE_CODE"),
	/**
	 * 体积
	 */
	ORDER_ATT_VOLUME("VOLUME"),
	/**
	 * 重量
	 */
	ORDER_ATT_WEIGHT("WEIGHT"),
	/**
	 * 商品
	 */
	ORDER_ATT_SKU("SKU"),

	/***************************************************************************
	 * AD_MODE 调整方式 SYS_WM_AD_MODE * ***********************************
	 */
	/**
	 * 增加
	 */
	AD_MODE_A("A"),

	/**
	 * 减少
	 */
	AD_MODE_R("R"),

	/***************************************************************************
	 * 费用相关 *
	 * ******************************************************************************
	 */

	/***************************************************************************
	 * SYS_WM_FEE_STATUS 费用状态 SYS_WM_FEE_STATUS *
	 * ************************************************************
	 */
	/**
	 * 创建
	 */
	FEE_NEW("00"),
	/**
	 * 审核
	 */
	FEE_AUDIT("10"),
	/***************************************************************************
	 * SYS_WM_ORDER_FEE_STATUS 订单提交状态 SYS_WM_ORDER_FEE_STATUS *
	 * ************************************************************
	 */
	/**
	 * 创建
	 */
	FEE_COMMIT_NEW("00"),
	/**
	 * 提交
	 */
	FEE_COMMIT("10"),

	/***************************************************************************
	 * OP_BILL_TRIGGER_TYPE 作业计费触发方式 SYS_WM_OP_BILL_TRIGGER_TYPE *
	 * *****************************************************************
	 */
	/**
	 * 即时计算
	 */
	OP_BILL_TRIGGER_TYPE_IMM("IMM"),

	/**
	 * 定时计算
	 */
	OP_BILL_TRIGGER_TYPE_TIMING("TIMING"),

	/***************************************************************************
	 * OP_BILL_TRIGGER_COND 作业计费触发条件 SYS_WMOP_BILL_TRIGGER_COND *
	 * *****************************************************************
	 */
	/**
	 * 关闭订单
	 */
	OP_BILL_TRIGGER_COND_ORDER("ORDER"),
	/**
	 * 产生交易
	 */
	OP_BILL_TRIGGER_COND_TRAN("TRAN"),

	/***************************************************************************
	 * INV_BILL_TRIGGER 库存计费触发方式 SYS_WM_INV_BILL_TRIGGER *
	 * **********************************************************
	 */
	/**
	 * 关闭出库单时计算
	 */
	INV_BILL_TRIGGER_OUT("OUT"),

	/**
	 * 定时计算
	 */
	INV_BILL_TRIGGER_TIMING("TIMING"),

	/***************************************************************************
	 * OP_BILL_CLASS 作业计费级别 SYS_WM_OP_BILL_CLASS *
	 * **************************************************
	 */
	/**
	 * 按订单
	 */
	OP_BILL_CLASS_ORDER("ORDER"),
	/**
	 * 按订单行
	 */
	OP_BILL_CLASS_LINE("LINE"),
	/**
	 * 按交易行
	 */
	OP_BILL_CLASS_TRAN("TRAN"),

	/***************************************************************************
	 * INV_BILL_CLASS 库存计费级别 SYS_WM_INV_BILL_CLASS *
	 * *****************************************************
	 */
	/**
	 * 按商品
	 */
	INV_BILL_CLASS_SKU("SKU"),
	/**
	 * 按批次
	 */
	INV_BILL_CLASS_LOT("LOT"),

	/***************************************************************************
	 * CONTRACT_TYPE 合同类型 SYS_WM_CONTRACT_TYPE *
	 * *****************************************************
	 */
	/**
	 * 客户
	 */
	CONTRACT_TYPE_CUSTOMER("CUSTOMER"),
	/**
	 * 外租仓库
	 */
	CONTRACT_TYPE_WH("WH"),
	/**
	 * 装卸队
	 */
	CONTRACT_TYPE_HANDING("HANDING"),

	/***************************************************************************
	 * FEE_CATEGORY 费用种类 SYS_WM_FEE_CATEGORY *
	 * *****************************************************
	 */
	/**
	 * 入库费用
	 */
	FEE_CATEGORY_INBOUND("INBOUND"),
	/**
	 * 出库费用
	 */
	FEE_CATEGORY_OUTBOUND("OUTBOUND"),
	/**
	 * 库存费用
	 */
	FEE_CATEGORY_INVENTORY("INVENTORY"),
	/**
	 * 服务增值费用
	 */
	FEE_CATEGORY_VAS("VAS"),
	/**
	 * 特殊费用
	 */
	FEE_CATEGORY_SPECIAL("SPECIAL"),
	/**
	 * 管理费用
	 */
	FEE_CATEGORY_MANAGE("MANAGE"),

	/***************************************************************************
	 * RECEIVE_PAY 收支类型 SYS_WM_RECEIVE_PAY *
	 * *****************************************************
	 */
	/**
	 * 收入
	 */
	FEE_RECEIVE("RECEIVE"),
	/**
	 * 支出
	 */
	FEE_PAY("PAY"),

	/***************************************************************************
	 * CHARGE_BASE 计费基准 SYS_WM_CHARGE_BASE *
	 * *****************************************************
	 */
	/**
	 * 库位
	 */
	CHARGE_BASE_LOC("LOC"),
	/**
	 * 计算托
	 */
	CHARGE_BASE_CALC_PALLET("CALC_PALLET"),
	/**
	 * 实际托
	 */
	CHARGE_BASE_ACT_PALLET("ACT_PALLET"),
	/**
	 * 箱
	 */
	CHARGE_BASE_CASE("CASE"),
	/**
	 * 数量EA
	 */
	CHARGE_BASE_QTY("QTY"),
	/**
	 * 体积
	 */
	CHARGE_BASE_CUBIC("CUBIC"),
	/**
	 * 重量
	 */
	CHARGE_BASE_WEIGHT("WEIGHT"),
	/**
	 * 计费吨
	 */
	CHARGE_BASE_RT("RT"),
	/**
	 * 固定费用
	 */
	CHARGE_BASE_CONSTANT("CONSTANT"),

	/***************************************************************************
	 * CHARGE_TYPE 计费方式 SYS_WM_CHARGE_TYPE *
	 * *****************************************************
	 */
	/**
	 * 普通
	 */
	CHARGE_TYPE_COMMON("COMMON"),
	/**
	 * 阶梯
	 */
	CHARGE_TYPE_LADDER("LADDER"),

	/***************************************************************************
	 * ROUNDING_TYPE 舍入方式 SYS_WM_ROUNDING_TYPE *
	 * *****************************************************
	 */
	/**
	 * 四舍五入
	 */
	ROUNDING_TYPE_ROUND("ROUND"),
	/**
	 * 向上取整
	 */
	ROUNDING_TYPE_CEIL("CEIL"),
	/**
	 * 向下取整
	 */
	ROUNDING_TYPE_FLOOR("FLOOR"),

	/***************************************************************************
	 * CYCLE_UNIT 周期单位 SYS_WM_CYCLE_UNIT *
	 * *****************************************************
	 */
	/**
	 * 年
	 */
	CYCLE_UNIT_YEAR("YEAR"),
	/**
	 * 月
	 */
	CYCLE_UNIT_MONTH("MONTH"),
	/**
	 * 周
	 */
	CYCLE_UNIT_WEEK("WEEK"),
	/**
	 * 日
	 */
	CYCLE_UNIT_DAY("DAY"),

	/***************************************************************************
	 * LADDER_TYPE 计费阶梯方式 SYS_WM_LADDER_TYPE *
	 * *****************************************************
	 */

	/**
	 * 单区间计费
	 */
	LADDER_TYPE_SINGLE("SINGLE"),
	/**
	 * 分区间计费求和
	 */
	LADDER_TYPE_MULTIPLE("MULTIPLE"),

	/***************************************************************************
	 * CLASS_TYPE 级差类型 SYS_WM_CLASS_TYPE *
	 * *****************************************************
	 */
	/**
	 * 按计费基准
	 */
	CLASS_TYPE_BASE("BASE"),
	/**
	 * 按库龄（天）
	 */
	CLASS_TYPE_AGE("AGE"),

	/***************************************************************************
	 * PRICE_TYPE 按单价/按总价 SYS_WM_PRICE_TYPE *
	 * *****************************************************
	 */

	/**
	 * 按单价
	 */
	PRICE_TYPE_UNIT("UNIT"),
	/**
	 * 按总价
	 */
	PRICE_TYPE_TOTAL("TOTAL"),

	/***************************************************************************
	 * WEIGHT_UNIT 重量单位 SYS_WM_WEIGHT_UNIT *
	 * *****************************************************
	 */
	/**
	 * 吨
	 */
	WEIGHT_UNIT_TON("TON"),

	/**
	 * 千克
	 */
	WEIGHT_UNIT_KG("KG"),

	/**
	 * 千克
	 */
	WEIGHT_UNIT_G("G"),

	/***************************************************************************
	 * VOLUME_UNIT 体积单位 SYS_WM_VOLUME_UNIT *
	 * *****************************************************
	 */
	/**
	 * 立方米
	 */
	VOLUME_UNIT_M3("M3"),

	/**
	 * 立方分米
	 */
	VOLUME_UNIT_DM3("DM3"),

	/**
	 * 立方厘米
	 */
	VOLUME_UNIT_CM3("CM3"),

	/**
	 * 盘点结果--匹配
	 */
	MATCH("MATCH"),
	/**
	 * 盘点结果--盘亏
	 */
	LOSS("LOSS"),
	/**
	 * 盘点结果--盘盈
	 */
	PROFIT("PROFIT"),
	/***************************************************************************
	 * RESERVE_CODE 加工确认 上架库位指定规则 SYS_WM_KIT_RESERVE_CODE *
	 * *****************************************************
	 */
	/**
	 * 加工确认时计算库位
	 */
	PARENT_KIT("KIT"),

	/***************************************************************************
	 * SUB_SELECT_CODE 加工 子件指定规则 SYS_WM_SUB_SELECT_CODE *
	 * *****************************************************
	 */
	/**
	 * 人工选择
	 */
	SUB_KIT_MAN("MAN"),
	/**
	 * 根据库存周转
	 */
	SUB_KIT_RT("RT"),

	/**
	 * 转移方式--转入
	 */
	I("I"),

	/**
	 * 转移方式--转出
	 */
	O("O"),

	/**
	 * 序列号库存交易--收货
	 */
	RCV("RCV"),
	/**
	 * 序列号库存交易--取消收货
	 */
	CRCV("CRCV"),
	/**
	 * 序列号库存交易--发货
	 */
	SP("SP"),
	/**
	 * 序列号库存交易--取消发货
	 */
	CSP("CSP"),

	/**
	 * 序列号库存交易--调增
	 */
	AIN("AIN"),
	/**
	 * 序列号库存交易--调减
	 */
	AOUT("AOUT"),
	/**
	 * 序列号库存交易--转入
	 */
	TIN("TIN"),
	/**
	 * 序列号库存交易--转出
	 */
	TOUT("TOUT"),

	/***************************************************************************
	 * CD_CLASS 商品 越库级别 SYS_WM_CD_CLASS *
	 * *****************************************************
	 */
	/**
	 * 商品越库级别--半越库
	 */
	CD_CLASS_PART("PART"),
	/**
	 * 商品越库级别--全越库
	 */
	CD_CLASS_FULL("FULL"),

	/***************************************************************************
	 * CD_TYPE ASN/SO 越库类型 SYS_WM_CD_TYPE *
	 * *****************************************************
	 */
	/**
	 * 分拨越库
	 */
	CD_TYPE_INDIRECT("INDIRECT"),
	/**
	 * 直接越库
	 */
	CD_TYPE_DIRECT("DIRECT"),

	/***************************************************************************
	 * CD_OUT_STEP 直接越库时出库执行的步骤 SYS_WM_CD_OUT_STEP *
	 * ***************************************************** /** 直接越库时出库执行的步骤
	 * 收货+分配
	 */
	RCV_ALLOC("RA"),
	/**
	 * 直接越库时出库执行的步骤 收货+分配+拣货
	 */
	RCV_ALLOC_PK("RAP"),
	/**
	 * 直接越库时出库执行的步骤 收货+分配+拣货+发货
	 */
	RCV_ALLOC_PK_SP("RAPS"),

	/***************************************************************************
	 * DOCK_USE_TYPE 月台使用类型 SYS_WM_DOCK_USE_TYPE *
	 * ***************************************************** /** 装
	 */
	DOCK_USE_TYPE_LOAD("LOAD"),
	/**
	 * 卸
	 */
	DOCK_USE_TYPE_UNLOAD("UNLOAD"),
	/**
	 * 装+卸
	 */
	DOCK_USE_TYPE_LU("LU"),
	/***************************************************************************
	 * STATUS 月台使用类型 SYS_WM_DOCK_APPOINT_STATUS *
	 * ***************************************************** /** 预约
	 */
	DOCK_STATUS_APPOINT("APPOINT"),
	/**
	 * 使用
	 */
	DOCK_STATUS_USE("USE"),
	/**
	 * 释放
	 */
	DOCK_STATUS_RELEASE("RELEASE"),
	/***************************************************************************
	 * MV移动单状态 SYS_WM_MV_STATUS * ***************************************
	 */
	/**
	 * MV创建
	 */
	MV_NEW("00"),
	/**
	 * MV部分移动
	 */
	MV_PART("10"),
	/**
	 * MV完全移动
	 */
	MV_FULL("20"),
	/**
	 * MV取消
	 */
	MV_CANCEL("90"),
	/**
	 * MV关闭
	 */
	MV_CLOSE("99");

	private String code;

	public String getCode() {
		return this.code;
	}

	WmsCodeMaster(String code) {
		this.code = code;
	}
}
